#
# rtfpessoa Homebrew file
#

# Cask
tap 'caskroom/cask'

# Versions
tap 'caskroom/versions'
tap 'homebrew/services'
tap 'homebrew/aliases'

# Build
brew 'autoconf'
brew 'automake'
brew 'gcc'
brew 'cmake'
brew 'libffi'
brew 'ncurses'

# VCS
brew 'git'

# Sec
brew 'openssl'
brew 'gnupg2'
brew 'gpg-agent'

# Editor
brew 'vim'
brew 'nano'

# Shell
brew 'fish'
brew 'tmux'

# Downloads
brew 'axel'
brew 'wget'
brew 'curl'

# Archives
brew 'unrar'

# Scala
cask 'java8'
brew 'scala'
brew 'sbt'
brew 'bloop'
brew 'scalafmt'

# Java
brew 'gradle'
brew 'maven'

# Languages
brew 'php'
brew 'perl'
brew 'go'

# GNU
brew 'coreutils'

# Casks
cask 'ngrok'

# Others
brew 'postgresql'
brew 'redis'

# Others
brew 'protobuf'
brew 'htop'
brew 'ripgrep'
brew 'jq'
brew 'ffmpeg'
brew 'youtube-dl'
brew 'watch'
