#
# rtfpessoa Homebrew file
#

# Cask
tap 'caskroom/cask'

# Versions
tap 'caskroom/versions'
tap 'homebrew/versions'
tap 'homebrew/services'
tap 'homebrew/completions'
tap 'homebrew/aliases'

# Build
brew 'autoconf'
brew 'automake'
brew 'gcc'
brew 'cmake'
brew 'maven'
brew 'gradle'
brew 'libffi'
brew 'ncurses'

# Languages

## PHP
tap 'homebrew/dupes'
tap 'homebrew/php'
brew 'homebrew/php/composer'

## Perl
brew 'perl'

# VCS
brew 'git'
brew 'mercurial'

# Sec
brew 'openssl'
brew 'gnupg2'
brew 'gpg-agent'

# Random
brew 'fasd'
brew 'sqlite'
brew 'tree'

# Editor
brew 'vim'
brew 'nano'

# Shell
brew 'zsh'

# Downloads
brew 'axel'
brew 'wget'
brew 'curl'

# Archives
brew 'unrar'

# Ruby
brew 'ruby'

# Scala / Play Framework / Highlight
brew 'grc'
brew 'sbt'
brew 'scala'

# GNU
brew 'gnu-sed'

# Casks
cask 'ngrok'
cask 'java'

# Others
brew 'sqlite'
brew 'postgresql'
brew 'redis'

# Others
brew 'openssl'
brew 'ripgrep'
brew 'jq'
brew 'ffmpeg'
brew 'youtube-dl'
brew 'watch'
