#
# rtfpessoa Homebrew file
#

# Install Cask
tap 'caskroom/cask'
tap 'homebrew/versions'
tap 'caskroom/versions'

# Build
brew 'autoconf'
brew 'automake'
brew 'gcc'
brew 'cmake'
brew 'maven'
brew 'gradle'

# Languages

## PHP
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/php'
brew 'homebrew/php/composer'
brew 'homebrew/php/php56'
brew 'homebrew/php/php56-xdebug'
brew 'homebrew/php/phpunit'

## C/C++
brew 'cppcheck'

## Javascript
brew 'node'
brew 'nvm'

## Java
brew 'pmd'

## Python
brew 'python'

# VCS
brew 'git'
brew 'mercurial'

# Sec
brew 'openssl'
brew 'gnupg2'
brew 'gpg-agent'

# Network
brew 'netcat'
brew 'ngrok'

# Random
brew 'ansible'
brew 'fasd'
brew 'sqlite'
brew 'thefuck'
brew 'tree'

# Editor
brew 'vim'
brew 'nano'

# Shell
brew 'zsh'

# Tmux
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'

# Downloads
brew 'axel'
brew 'wget'
brew 'curl'

# Archives
brew 'unrar'

# Scala / Play Framework / Highlight
brew 'grc'
brew 'sbt'
brew 'scala'

# Install Casks
cask 'caffeine'
cask 'flux'
cask 'google-chrome-beta'
cask 'iterm2-beta'
cask 'slack'
cask 'java'

# Docker
cask 'virtualbox'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'

# LaTeX
tap 'homebrew/tex'
brew 'homebrew/tex/latex-mk'
cask 'mactex'
